zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
#include "game/hu3d.h"
#include "game/object.h"
#include "game/objsub.h"


#include "game/frand.h"
#include "game/sprite.h"

#include "REL/m455Dll.h"

#include "ext_math.h"
#include "math.h"
#include "version.h"
#include <string.h>

Process *lbl_1_bss_70;
omObjData *lbl_1_bss_6C;
omObjData *lbl_1_bss_68;
omObjData *lbl_1_bss_64;
omObjData *lbl_1_bss_60;
omObjData *lbl_1_bss_5C;
omObjData *lbl_1_bss_58;
Vec lbl_1_bss_4C;

typedef struct struct_bss48 {
    ANIMDATA *unk0[4];
    s32 unk10[4];
    Vec unk20;
} StructBss48;

StructBss48 *lbl_1_bss_48;

Vec lbl_1_data_1D8[4] = {
    { -460, 0, 150 },
    { 460, 0, 150 },
    { -460, 0, -150 },
    { 460, 0, -150 },
};

GXColor lbl_1_data_208 = { 255, 255, 255, 255 };

typedef struct struct_data20C {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    BOOL unk10;
} StructData20C;

StructData20C lbl_1_data_20C[4] = {
    { 400, 400, 400, 400, FALSE },
    { 640, 480, 320, 240, TRUE },
    { 640, 480, 640, 480, FALSE },
    { 640, 480, 320, 240, TRUE },
};

void fn_1_8EAC(void);

void fn_1_6914(omObjData *object);
void fn_1_7280(omObjData *object);
void fn_1_75C0(omObjData *object);
void fn_1_7C48(omObjData *object);
void fn_1_891C(omObjData *object);

omObjData *fn_1_347C(void);

void fn_1_32C4(Process *objman)
{
    lbl_1_bss_70 = objman;
    fn_1_8EAC();
    lbl_1_bss_68 = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_6914);
    lbl_1_bss_64 = omAddObjEx(lbl_1_bss_70, 50, 8, 0, -1, fn_1_7280);
    lbl_1_bss_60 = omAddObjEx(lbl_1_bss_70, 50, 1, 0, -1, fn_1_75C0);
    lbl_1_bss_5C = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_7C48);
    lbl_1_bss_58 = omAddObjEx(lbl_1_bss_70, 50, 0, 0, -1, fn_1_891C);
    lbl_1_bss_6C = fn_1_347C();
}

void fn_1_4104(omObjData *object);

void fn_1_6C60(omObjData *object);
void fn_1_7430(omObjData *object);
void fn_1_7974(omObjData *object);
void fn_1_8474(omObjData *object);

void fn_1_9168(void);

void fn_1_340C(void)
{
    fn_1_4104(lbl_1_bss_6C);
    fn_1_9168();
    fn_1_6C60(lbl_1_bss_68);
    fn_1_7430(lbl_1_bss_64);
    fn_1_7974(lbl_1_bss_60);
    fn_1_8474(lbl_1_bss_5C);
}

typedef struct work_347C_unk4 {
    void *bmpData;
    u32 unk4;
    BOOL unk8;
    s32 unkC;
    s32 unk10;
    s32 sizeX;
    s32 sizeY;
} Work347CUnk4;

typedef struct work_347C_unk74 {
    Vec unk0;
    Vec unkC;
    float unk18;
    u16 unk1C;
    u16 unk1E;
} Work347CUnk74;

typedef struct work_347C {
    s32 unk0;
    Work347CUnk4 unk4[4];
    Work347CUnk74 unk74[64];
    float unk874[26][2];
    float unk944[26][2];
    void *unkA14;
    u32 unkA18;
    ANIMDATA *unkA1C[9];
    float unkA40;
    float unkA44;
    u32 unkA48;
    u32 unkA4C;
    u32 unkA50;
    float unkA54;
    float unkA58;
} Work347C;

void fn_1_3DDC(omObjData *object);

void fn_1_4180(HU3DMODEL *model, Mtx matrix);
void fn_1_49AC(HU3DMODEL *model, Mtx matrix);
void fn_1_4E64(HU3DMODEL *model, Mtx matrix);

omObjData *fn_1_347C(void)
{
    omObjData *object = omAddObjEx(lbl_1_bss_70, 127, 15, 0, -1, fn_1_3DDC);
    Work347C *work = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work347C), MEMORY_DEFAULT_NUM);
    Work347C *work2 = work;
    Work347CUnk74 *workUnk74 = &work->unk74[0];
    Work347CUnk4 *workUnk4;
    s32 id;
    HU3DMODEL *modelP;
    s32 i;

    work->unkA40 = 0;
    work->unkA44 = 0;
    work->unkA48 = 0;
    work->unkA4C = 0;
    work->unkA50 = 0;
    work->unkA54 = 0;
    work->unkA58 = 0;

    object->model[0] = id = Hu3DHookFuncCreate(fn_1_4E64);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 5);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work->unkA1C[4] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 21), MEMORY_DEFAULT_NUM));
    work->unkA1C[5] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 22), MEMORY_DEFAULT_NUM));
    work->unkA1C[6] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 23), MEMORY_DEFAULT_NUM));
    work->unkA1C[7] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 24), MEMORY_DEFAULT_NUM));
    work->unkA1C[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 17), MEMORY_DEFAULT_NUM));
    work->unkA1C[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 18), MEMORY_DEFAULT_NUM));
    work->unkA1C[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 19), MEMORY_DEFAULT_NUM));
    work->unkA1C[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 20), MEMORY_DEFAULT_NUM));
    work->unkA1C[8] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 25), MEMORY_DEFAULT_NUM));
    object->model[1] = id = Hu3DHookFuncCreate(fn_1_4180);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 0);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work2->unkA18 = 16384;
    work2->unkA14 = HuMemDirectMallocNum(HEAP_SYSTEM, work2->unkA18, MEMORY_DEFAULT_NUM);
    DCFlushRange(work2->unkA14, 16384);
    GXBeginDisplayList(work2->unkA14, work2->unkA18);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition2f32(-0.5f, -0.5f);
    GXTexCoord2f32(0, 0);
    GXPosition2f32(0.5f, -0.5f);
    GXTexCoord2f32(1, 0);
    GXPosition2f32(0.5f, 0.5f);
    GXTexCoord2f32(1, 1);
    GXPosition2f32(-0.5f, 0.5f);
    GXTexCoord2f32(0, 1);
    GXEnd();
    work2->unkA18 = GXEndDisplayList();
    for (i = 0; i < 26; i++) {
        work2->unk874[i][0] = 0;
        work2->unk874[i][1] = 0;
        work2->unk944[i][0] = 0;
        work2->unk944[i][1] = 0;
    }

    object->model[3] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 5));
    Hu3DModelPosSet(id, 0, 0, -5000);
    Hu3DModelScaleSet(id, 2, 2, 2);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);
    id = Hu3DTexScrollCreate(object->model[3], "S3TCsk");
    Hu3DTexScrollPosMoveSet(id, -0.0055f * REFRESH_FREQ, 0, 0);
    id = Hu3DTexScrollCreate(object->model[3], "pa_sk3");
    Hu3DTexScrollPosMoveSet(id, -0.0125f * REFRESH_FREQ, 0, 0);
    
    object->model[4] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 6));
    Hu3DModelPosSet(id, 0, 0, -3000);
    Hu3DModelScaleSet(id, 1.2f, 1.2f, 1.2f);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);

    object->model[8] = id = Hu3DHookFuncCreate(fn_1_49AC);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 2);
    modelP = &Hu3DData[id];
    modelP->hookData = work;

    object->model[10] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 0));
    Hu3DModelPosSet(id, 0, 0, 0);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 3);
    Hu3DModelShadowMapSet(object->model[10]);
    for (i = 0; i < 4; i++) {

        object->model[i + 11] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 1));
        Hu3DModelCameraSet(object->model[i + 11], HU3D_CAM0);
        Hu3DModelLayerSet(object->model[i + 11], 3);
        Hu3DModelPosSet(object->model[i + 11], lbl_1_data_1D8[i].x, lbl_1_data_1D8[i].y, lbl_1_data_1D8[i].z);
        Hu3DModelAttrSet(object->model[i + 11], HU3D_MOTATTR_SHAPE_LOOP);
        Hu3DMotionShapeTimeSet(object->model[i + 11], (0.25 * i) * Hu3DMotionShapeMaxTimeGet(object->model[i + 11]));
    }
    modelP = &Hu3DData[object->model[0]];
    workUnk4 = &work2->unk4[0];
    for (i = 0; i < 4; i++, workUnk4++) {
        workUnk4->unkC = lbl_1_data_20C[i].unk0;
        workUnk4->unk10 = lbl_1_data_20C[i].unk4;
        workUnk4->sizeX = lbl_1_data_20C[i].unk8;
        workUnk4->sizeY = lbl_1_data_20C[i].unkC;
        workUnk4->unk8 = lbl_1_data_20C[i].unk10;
        workUnk4->unk4 = GXGetTexBufferSize(workUnk4->sizeX, workUnk4->sizeY, GX_TF_RGB565, GX_FALSE, GX_FALSE);
        workUnk4->bmpData = HuMemDirectMallocNum(HEAP_DATA, workUnk4->unk4, modelP->mallocNo);
        memset(workUnk4->bmpData, 0, workUnk4->unk4);
        DCFlushRange(workUnk4->bmpData, workUnk4->unk4);
    }
    for (i = 0; i < 64; i++, workUnk74++) {
        workUnk74->unk0.x = workUnk74->unk0.y = workUnk74->unk0.z = 0;
        workUnk74->unkC.x = 0;
        workUnk74->unkC.y = 0;
        workUnk74->unkC.z = 1;
        workUnk74->unk18 = REFRESH_FREQ;
        workUnk74->unk1C = REFRESH_RATE;
        workUnk74->unk1E = 0;
    }
    return object;
}

void fn_1_9CFC(float arg0);

void fn_1_3DDC(omObjData *object)
{
    Work347C *work = object->data;
    Work347C *work2 = work;
    s32 i;
    if ((work->unkA50 = work->unkA50 + (0.007874016f * ((s32)frand() & 0x7F) * 3.0f)) > 360) {
        work->unkA50 -= 360;
    }
    work->unkA44 = (25 + work->unkA40) + (5.0 * sind(work->unkA50));
    Hu3DModelPosSet(object->model[10], 0, work->unkA44, 0);
    for (i = 0; i < 4; i++) {
        Hu3DModelPosSet(object->model[i + 11], lbl_1_data_1D8[i].x, work->unkA44 + lbl_1_data_1D8[i].y, lbl_1_data_1D8[i].z);
    }
    work->unkA54 += 6.0f / (REFRESH_RATE_F * 100.0f);
    work->unkA58 += 6.0f / (REFRESH_RATE_F * 100.0f);
    work->unkA48++;
    work->unkA4C++;
    if(work->unkA4C >= REFRESH_RATE_F && work->unkA4C <= REFRESH_RATE_F * 1.35f) {
        float time = 1 - ((work->unkA4C - REFRESH_RATE_F) / (REFRESH_RATE_F * 0.35f));
        if(time < 0.0f) {
            time = 0.0f;
        }
        fn_1_9CFC(time);
    }
}

void fn_1_4104(omObjData *object)
{
    Work347C *work = object->data;
    HuSprAnimKill(work->unkA1C[0]);
    HuSprAnimKill(work->unkA1C[1]);
    HuSprAnimKill(work->unkA1C[2]);
    HuSprAnimKill(work->unkA1C[3]);
    HuSprAnimKill(work->unkA1C[6]);
    HuSprAnimKill(work->unkA1C[7]);
    HuSprAnimKill(work->unkA1C[4]);
    HuSprAnimKill(work->unkA1C[5]);
    HuSprAnimKill(work->unkA1C[8]);
}

GXColor lbl_1_data_26A = { 255, 255, 255, 32 };
GXColor lbl_1_data_26E = { 255, 255, 255, 10 };
GXColor lbl_1_data_272 = { 0, 126, 126, 255 };
Vec lbl_1_data_278[4] = { -1000, 50, 1000, -1000, 50, -1000, 1000, 50, -1000, 1000, 50, 1000 };

Vec lbl_1_data_2A8[26] = { -1500, 0, 1000, -1400, 0, 1000, 0, 0, 1000, 1400, 0, 1000, 1500, 0, 1000, -1500, 0, -500, -1400, 0, -500, 0, 0, -500, 1400,
    0, -500, 1500, 0, -500, -1500, 0, -2000, -1400, 0, -2000, 0, 0, -2000, 1400, 0, -2000, 1500, 0, -2000, -1500, 0, -5000, -1400, 0, -5000, 0, 0,
    -5000, 1400, 0, -5000, 1500, 0, -5000, -2000, 0, -500, -2500, 0, -2000, -3000, 0, -5000, 2000, 0, -500, 2500, 0, -2000, 3000, 0, -5000 };

