zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
GXColor lbl_1_data_3E0[26] = { { 96, 128, 255, 255 }, { 128, 160, 255, 32 }, { 128, 160, 255, 32 }, { 128, 160, 255, 32 }, { 96, 128, 255, 255 },
    { 24, 48, 255, 255 }, { 96, 128, 255, 32 }, { 128, 160, 255, 32 }, { 96, 128, 255, 32 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 },
    { 24, 48, 255, 255 }, { 96, 128, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 8, 24, 143, 255 }, { 8, 24, 143, 255 },
    { 8, 24, 143, 255 }, { 8, 24, 143, 255 }, { 8, 24, 143, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 },
    { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 } };

float lbl_1_data_448[26][2]
    = { 0, 1, 0.033333335, 1, 0.5, 1, 0.96666664, 1, 1, 1, 0, 0.5, 0.033333335, 0.5, 0.5, 0.5, 0.96666664, 0.5, 1, 0.5, 0, 0, 0.033333335, 0, 0.5, 0,
          0.96666664, 0, 1, 0, 0, 0, 0.033333335, 0, 0.5, 0, 0.96666664, 0, 1, 0, -0.15, 0.5, -0.33, 0, -0.49, 0, 1.15, 0.5, 1.33, 0, 1.49, 0 };

float lbl_1_data_518[26][2] = { 0, 30, 0.5, 30, 7.5, 30, 14.5, 30, 15, 30, 0, 15, 0.5, 15, 7.5, 15, 14.5, 15, 15, 15, 0, 7.5, 0.5, 7.5, 7.5, 7.5,
    14.5, 7.5, 15, 7.5, 0, 0, 0.5, 0, 7.5, 0, 14.5, 0, 15, 0, -2.25, 15, -4.9500003, 7.5, -7.3500004, 0, 17.25, 15, 19.95, 7.5, 22.35, 0 };

float lbl_1_data_5E8[2][3] = { 0, 0, 0.5, 0, 0.5, 0 };

GXColor lbl_1_data_600 = { 80, 80, 80, 80 };

Vec lbl_1_data_604[9]
    = { -1500, 0, -5000, 0, 0, -5000, 1500, 0, -5000, -1500, 0, -3000, 0, 0, -3000, 1500, 0, -3000, -1500, 0, 1000, 0, 0, 1000, 1500, 0, 1000 };

GXColor lbl_1_data_670[9] = {
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
};

GXColor lbl_1_data_694 = { 255, 165, 89, 178 };
GXColor lbl_1_data_698 = { 153, 114, 89, 178 };
GXColor lbl_1_data_69C = { 0, 0, 0, 255 };

void fn_1_6088(Work347CUnk4 *arg0, s32 arg1);

void fn_1_4180(HU3DMODEL *model, Mtx matrix)
{
    Work347C *work = model->hookData;
    Work347C *work2 = work;
    Work347CUnk74 *workUnk74 = &work2->unk74[0];
    Work347CUnk4 *workUnk4 = &work2->unk4[0];
    s32 i;
#ifdef NON_MATCHING
    Mtx44 proj;
#else
    Mtx proj;
#endif
    Mtx modelview;
    MTXOrtho(proj, 0, 480, 0, 640, 0, 100);
    GXSetProjection(proj, GX_ORTHOGRAPHIC);
    MTXIdentity(modelview);
    GXLoadPosMtxImm(modelview, GX_PNMTX0);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_REG, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_272);
    GXSetTevColor(GX_TEVREG0, lbl_1_data_26E);
    GXSetNumTexGens(1);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
    GXSetAlphaCompare(GX_ALWAYS, 0, GX_AOP_AND, GX_ALWAYS, 0);
    GXSetNumTevStages(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_PASSCLR);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_RASC, GX_CC_TEXC, GX_CC_A0, GX_CC_ZERO);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_KONST);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetScissor(0, 0, 400, 400);
    HuSprTexLoad(work->unkA1C[4], 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XY, GX_U16, 0);
    GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition2u16(0, 0);
    GXTexCoord2f32(work->unkA54, work->unkA58);
    GXPosition2u16(400, 0);
    GXTexCoord2f32(work->unkA54 + 7, work->unkA58);
    GXPosition2u16(400, 400);
    GXTexCoord2f32(work->unkA54 + 7, work->unkA58 + 7);
    GXPosition2u16(0, 400);
    GXTexCoord2f32(work->unkA54, work->unkA58 + 7);
    GXEnd();
    GXSetNumTexGens(1);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetNumTevStages(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_REPLACE);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_TEXC);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    HuSprTexLoad(work->unkA1C[8], 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXClearVtxDesc();
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XY, GX_F32, 0);
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
    workUnk74 = &work2->unk74[0];
    for (i = 0; i < 64; i++, workUnk74++) {
        float scale;
        float accel;
        if (workUnk74->unk1E == 0) {
            continue;
        }
        scale = 128 * (workUnk74->unkC.x * (0.2f + cosd(workUnk74->unk1E * workUnk74->unk18 * 90.0f)));
        accel = workUnk74->unk1E * workUnk74->unk18;
        lbl_1_data_26A.a = workUnk74->unkC.z * sind((accel * accel) * 90.0f) * 255.0;
        GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_26A);
        MTXScale(modelview, 0.5f * scale, 0.5f * scale, 1.0f);
        mtxRotCat(modelview, 0, 0, workUnk74->unkC.y);
        mtxTransCat(modelview, 400 * (workUnk74->unk0.x + 1500) / 3000, 400 * (workUnk74->unk0.z - -2000) / 3000, 0);
        GXLoadPosMtxImm(modelview, GX_PNMTX0);
        GXCallDisplayList(work2->unkA14, work2->unkA18);
        if (!omPauseChk()) {
            workUnk74->unk1E--;
        }
    }
    workUnk4 = &work2->unk4[0];
    fn_1_6088(workUnk4, 1);
}

void fn_1_59A0(HU3DMODEL *model, Mtx matrix);

void fn_1_49AC(HU3DMODEL *model, Mtx matrix)
{
    Work347C *work;
    Work347C *work2;
    Work347CUnk4 *workUnk4;
    fn_1_59A0(model, matrix);
    work = model->hookData;
    work2 = work;
    workUnk4 = &work2->unk4[1];
    fn_1_6088(workUnk4, 0);
}

void fn_1_6144(Work347CUnk4 *arg0, float arg1, float arg2, float arg3);

void fn_1_4A14(HU3DMODEL *model, Mtx matrix)
{
    Work347C *work = model->hookData;
    Work347C *work2 = work;
    Work347CUnk4 *workUnk4 = &work2->unk4[0];

    fn_1_6144(workUnk4, 200, 0, 0.5f);
    workUnk4 = &work2->unk4[1];
    fn_1_6144(workUnk4, 0, 0, 0.5f);
    workUnk4 = &work2->unk4[2];
    fn_1_6144(workUnk4, 0, 150, 0.25f);
    workUnk4 = &work2->unk4[3];
    fn_1_6144(workUnk4, 0, 300, 0.5f);
}

void fn_1_6594(s16 arg0, Work347CUnk4 *arg1, GXTexWrapMode arg2, s32 arg3, BOOL arg4);

void fn_1_4B1C(HU3DMODEL *model, Mtx matrix)
{
    HU3DCAMERA *cameraP = &Hu3DCamera[Hu3DCameraNo];
    Work347C *work = model->hookData;
    Work347C *work2 = work;
    Work347CUnk4 *workUnk4 = &work2->unk4[2];
    float fov;
    Mtx proj;
    Mtx texMtx;
    Mtx projCamera;
    s16 lightMask;
    s16 i;

    fn_1_6088(workUnk4, 0);
    GXLoadPosMtxImm(matrix, GX_PNMTX0);
    fov = cameraP->fov;
    if (fov <= 0.0f) {
        fov = 45;
    }
    MTXLightPerspective(proj, fov, 1.2f, 0.5f, -0.5f, 0.5f, 0.5f);
    MTXInverse(Hu3DCameraMtx, texMtx);
    MTXConcat(texMtx, Hu3DCameraMtx, texMtx);
    MTXConcat(proj, Hu3DCameraMtx, projCamera);
    MTXConcat(projCamera, texMtx, texMtx);
    GXLoadTexMtxImm(texMtx, GX_TEXMTX0, GX_MTX3x4);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX3x4, GX_TG_POS, GX_TEXMTX0);
    lightMask = Hu3DLightSet(model, &Hu3DCameraMtx, &Hu3DCameraMtxXPose, 4);
    GXSetNumTevStages(1);
    GXSetNumTexGens(1);
    GXSetNumChans(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_REPLACE);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_REG, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_208);
    GXSetZMode(GX_TRUE, GX_GREATER, GX_FALSE);
    GXSetAlphaCompare(GX_ALWAYS, 0, GX_AOP_AND, GX_ALWAYS, 0);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    workUnk4 = &work2->unk4[1];
    fn_1_6594(0, workUnk4, 0, 0, 0);
    GXClearVtxDesc();
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
    GXSETARRAY(GX_VA_POS, lbl_1_data_278, sizeof(lbl_1_data_278), sizeof(Vec), TRUE);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    for (i = 0; i < 4; i++) {
        GXPosition1x16(i);
    }
    GXEnd();
    workUnk4 = &work2->unk4[3];
    fn_1_6088(workUnk4, 0);
    workUnk4 = &work2->unk4[2];
    fn_1_6594(0, workUnk4, 0, 0, 0);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    for (i = 0; i < 4; i++) {
        GXPosition1x16(i);
    }
    GXEnd();
}

void fn_1_4E64(HU3DMODEL *model, Mtx matrix)
{
    HU3DCAMERA *cameraP = &Hu3DCamera[Hu3DCameraNo];
    Work347C *work = model->hookData;
    Work347C *work2 = work;
    Work347CUnk4 *workUnk4 = &work2->unk4[2];
    Mtx invXPose;
    Mtx proj;
    Mtx texMtx;
    Mtx projCamera;
    float sp14;
    float sp10;
    float fov;
    s16 i;
    fn_1_4B1C(model, matrix);
    sp14 = 1.5f;
    sp10 = 0;
    GXLoadPosMtxImm(matrix, GX_PNMTX0);
    MTXInvXpose(matrix, invXPose);
    GXLoadNrmMtxImm(invXPose, GX_PNMTX0);
    fov = cameraP->fov;
    if (fov <= 0.0f) {
        fov = 45;
    }
    MTXLightPerspective(proj, fov, 1.2f, 0.5f, -0.5f, 0.5f, 0.5f);
    MTXInverse(Hu3DCameraMtx, texMtx);
    MTXConcat(texMtx, Hu3DCameraMtx, texMtx);
    MTXConcat(proj, Hu3DCameraMtx, projCamera);
    MTXConcat(projCamera, texMtx, texMtx);
    GXLoadTexMtxImm(texMtx, GX_TEXMTX0, GX_MTX3x4);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX3x4, GX_TG_POS, GX_TEXMTX0);
    GXSetTexCoordGen(GX_TEXCOORD1, GX_TG_MTX2x4, GX_TG_TEX1, GX_IDENTITY);
    GXSetNumTevStages(2);
    GXSetNumTexGens(3);
    GXSetNumChans(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOrder(GX_TEVSTAGE1, GX_TEXCOORD1, GX_TEXMAP1, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_REPLACE);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_TEXC, GX_CC_RASC, GX_CC_RASA, GX_CC_ZERO);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_KONST, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevColor(GX_TEVREG0, lbl_1_data_600);
    GXSetTevColorIn(GX_TEVSTAGE1, GX_CC_ZERO, GX_CC_C0, GX_CC_TEXA, GX_CC_CPREV);
    GXSetTevColorOp(GX_TEVSTAGE1, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE1, GX_CA_KONST, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE1, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_VTX, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_208);
    GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
    GXSetAlphaCompare(GX_ALWAYS, 0, GX_AOP_AND, GX_ALWAYS, 0);
    GXSetBlendMode(GX_BM_NONE, GX_BL_ONE, GX_BL_ZERO, GX_LO_NOOP);
    workUnk4 = &work2->unk4[3];
    fn_1_6594(0, workUnk4, 0, 0, 0);
    HuSprTexLoad(work->unkA1C[3], 0, 1, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    workUnk4 = &work2->unk4[0];
    fn_1_6594(2, workUnk4, 0, 0, 1);
    GXSetTexCoordGen(GX_TEXCOORD2, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetNumIndStages(1);
    GXSetIndTexOrder(GX_INDTEXSTAGE0, GX_TEXCOORD2, GX_TEXMAP2);
    GXSetIndTexCoordScale(GX_INDTEXSTAGE0, GX_ITS_1, GX_ITS_1);
    GXSetTevIndWarp(GX_TEVSTAGE0, GX_INDTEXSTAGE0, GX_TRUE, GX_FALSE, GX_ITM_1);
    GXSetIndTexMtx(GX_ITM_1, lbl_1_data_5E8, -1);
    for (i = 0; i < 26; i++) {
        work2->unk944[i][0] -= 0.007874016f * ((s32)frand() & 0x7F) * 0.005f;
        work2->unk944[i][1] += 0.007874016f * ((s32)frand() & 0x7F) * 0.005f;
        work2->unk874[i][0] = work2->unk944[i][0] + lbl_1_data_518[i][0];
        work2->unk874[i][1] = work2->unk944[i][1] + lbl_1_data_518[i][1];
    }
    DCFlushRange(&work2->unk874[0][0], sizeof(work2->unk874));
    GXClearVtxDesc();
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSetVtxDesc(GX_VA_POS, GX_INDEX16);

