zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
    GXSETARRAY(GX_VA_POS, lbl_1_data_2A8, sizeof(lbl_1_data_2A8), sizeof(Vec), TRUE);
    GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
    GXSETARRAY(GX_VA_CLR0, lbl_1_data_3E0, sizeof(lbl_1_data_3E0), sizeof(GXColor), TRUE);
    GXSetVtxDesc(GX_VA_TEX0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXSETARRAY(GX_VA_TEX0, lbl_1_data_448, sizeof(lbl_1_data_448), sizeof(float) * 2, TRUE);
    GXSetVtxDesc(GX_VA_TEX1, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX1, GX_TEX_ST, GX_F32, 0);
    GXSETARRAY(GX_VA_TEX1, &work2->unk874[0][0], sizeof(work2->unk874), sizeof(float) * 2, TRUE);
    GXBegin(GX_QUADS, GX_VTXFMT0, 48);
    for (i = 0; i < 12; i++) {
        s16 index;
        if (i == 4) {
            index = 12;
        }
        else if (i == 9) {
            index = 13;
        }
        else {
            index = i;
        }
        GXPosition1x16(index + 0);
        GXColor1x16(index + 0);
        GXTexCoord1x16(index + 0);
        GXTexCoord1x16(index + 0);
        GXPosition1x16(index + 5);
        GXColor1x16(index + 5);
        GXTexCoord1x16(index + 5);
        GXTexCoord1x16(index + 5);
        GXPosition1x16(index + 6);
        GXColor1x16(index + 6);
        GXTexCoord1x16(index + 6);
        GXTexCoord1x16(index + 6);
        GXPosition1x16(index + 1);
        GXColor1x16(index + 1);
        GXTexCoord1x16(index + 1);
        GXTexCoord1x16(index + 1);
    }
    GXEnd();
    GXBegin(GX_TRIANGLESTRIP, GX_VTXFMT0, 8);
    GXPosition1x16(22);
    GXColor1x16(22);
    GXTexCoord1x16(22);
    GXTexCoord1x16(22);
    GXPosition1x16(15);
    GXColor1x16(15);
    GXTexCoord1x16(15);
    GXTexCoord1x16(15);
    GXPosition1x16(21);
    GXColor1x16(21);
    GXTexCoord1x16(21);
    GXTexCoord1x16(21);
    GXPosition1x16(10);
    GXColor1x16(10);
    GXTexCoord1x16(10);
    GXTexCoord1x16(10);
    GXPosition1x16(20);
    GXColor1x16(20);
    GXTexCoord1x16(20);
    GXTexCoord1x16(20);
    GXPosition1x16(5);
    GXColor1x16(5);
    GXTexCoord1x16(5);
    GXTexCoord1x16(5);
    GXPosition1x16(0);
    GXColor1x16(0);
    GXTexCoord1x16(0);
    GXTexCoord1x16(0);
    GXPosition1x16(0);
    GXColor1x16(0);
    GXTexCoord1x16(0);
    GXTexCoord1x16(0);
    GXEnd();
    GXBegin(GX_TRIANGLESTRIP, GX_VTXFMT0, 8);
    GXPosition1x16(19);
    GXColor1x16(19);
    GXTexCoord1x16(19);
    GXTexCoord1x16(19);
    GXPosition1x16(25);
    GXColor1x16(25);
    GXTexCoord1x16(25);
    GXTexCoord1x16(25);
    GXPosition1x16(14);
    GXColor1x16(14);
    GXTexCoord1x16(14);
    GXTexCoord1x16(14);
    GXPosition1x16(24);
    GXColor1x16(24);
    GXTexCoord1x16(24);
    GXTexCoord1x16(24);
    GXPosition1x16(9);
    GXColor1x16(9);
    GXTexCoord1x16(9);
    GXTexCoord1x16(9);
    GXPosition1x16(23);
    GXColor1x16(23);
    GXTexCoord1x16(23);
    GXTexCoord1x16(23);
    GXPosition1x16(4);
    GXColor1x16(4);
    GXTexCoord1x16(4);
    GXTexCoord1x16(4);
    GXPosition1x16(4);
    GXColor1x16(4);
    GXTexCoord1x16(4);
    GXTexCoord1x16(4);
    GXEnd();
    GXSetNumIndStages(0);
    GXSetTevDirect(GX_TEVSTAGE0);
    GXSetTevDirect(GX_TEVSTAGE1);
}

void fn_1_59A0(HU3DMODEL *model, Mtx matrix)
{
    s32 sp10 = 0;
    Work347C *work = model->hookData;
    float scale = 1.5f;
    float x = 0;
    Mtx temp;
    Mtx final;
    MTXTrans(final, x, -300, 0);
    GXSetTevColor(GX_TEVREG0, lbl_1_data_694);
    MTXScale(temp, scale, 1, 1);
    MTXConcat(final, temp, final);
    MTXConcat(Hu3DCameraMtx, final, final);
    GXLoadPosMtxImm(final, GX_PNMTX0);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_208);
    HuSprTexLoad(work->unkA1C[0], 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    HuSprTexLoad(work->unkA1C[1], 0, 1, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXSetNumTexGens(2);
    MTXRotDeg(final, 'X', 90.0f);
    x = 0.004f * scale;
    MTXScale(temp, x, -0.004f, 0.004f);
    MTXConcat(final, temp, final);
    MTXTrans(temp, (work->unkA48 % 1024) / (512.0f * x), 0, 1.2499999f * (work->unkA48 % 400));
    MTXConcat(final, temp, final);
    GXLoadTexMtxImm(final, GX_TEXMTX0, GX_MTX2x4);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_POS, GX_TEXMTX0);
    MTXRotDeg(final, 'X', 90.0f);
    x = 0.004f * scale;
    MTXScale(temp, x, -0.004f, 0.004f);
    MTXConcat(final, temp, final);
    MTXTrans(temp, (work->unkA48 % 300) / (150.0f * x), 0, 0);
    MTXConcat(final, temp, final);
    GXLoadTexMtxImm(final, GX_TEXMTX1, GX_MTX2x4);
    GXSetTexCoordGen(GX_TEXCOORD1, GX_TG_MTX2x4, GX_TG_POS, GX_TEXMTX1);
    GXSetNumTevStages(2);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_C0);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevOrder(GX_TEVSTAGE1, GX_TEXCOORD1, GX_TEXMAP1, GX_COLOR_NULL);
    GXSetTevColorIn(GX_TEVSTAGE1, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_CPREV);
    GXSetTevColorOp(GX_TEVSTAGE1, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE1, GX_CA_ZERO, GX_CA_TEXA, GX_CA_APREV, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE1, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_SET);
    GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_INDEX8);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSetVtxDesc(GX_VA_CLR0, GX_INDEX8);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
    GXSETARRAY(GX_VA_POS, lbl_1_data_604, sizeof(lbl_1_data_604), sizeof(Vec), TRUE);
    GXSETARRAY(GX_VA_CLR0, lbl_1_data_670, sizeof(lbl_1_data_670), sizeof(GXColor), TRUE);
    GXBegin(GX_TRIANGLESTRIP, GX_VTXFMT0, 6);
    GXPosition1x8(0);
    GXColor1x8(0);
    GXPosition1x8(1);
    GXColor1x8(1);
    GXPosition1x8(3);
    GXColor1x8(3);
    GXPosition1x8(4);
    GXColor1x8(4);
    GXPosition1x8(6);
    GXColor1x8(6);
    GXPosition1x8(7);
    GXColor1x8(7);
    GXEnd();
    GXBegin(GX_TRIANGLESTRIP, GX_VTXFMT0, 6);
    GXPosition1x8(1);
    GXColor1x8(1);
    GXPosition1x8(2);
    GXColor1x8(2);
    GXPosition1x8(4);
    GXColor1x8(4);
    GXPosition1x8(5);
    GXColor1x8(5);
    GXPosition1x8(7);
    GXColor1x8(7);
    GXPosition1x8(8);
    GXColor1x8(8);
    GXEnd();
}

void fn_1_6088(Work347CUnk4 *arg0, s32 arg1)
{
    GXSetTexCopySrc(0, 0, arg0->unkC, arg0->unk10);
    GXSetTexCopyDst(arg0->sizeX, arg0->sizeY, GX_TF_RGB565, arg0->unk8);
    GXSetCopyClear(lbl_1_data_69C, GX_MAX_Z24);
    GXCopyTex(arg0->bmpData, arg1);
}

