zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
void fn_1_6144(Work347CUnk4 *fbWork, float x1, float y1, float scale)
{
    float x2 = x1 + (fbWork->sizeX * scale);
    float y2 = y1 + (fbWork->sizeY * scale);
    Mtx44 proj;
    Mtx modelview;
    GXTexObj texObj;
    GXColor color;
    GXInitTexObj(&texObj, fbWork->bmpData, fbWork->sizeX, fbWork->sizeY, GX_TF_RGB565, GX_CLAMP, GX_CLAMP, GX_FALSE);
    GXInitTexObjLOD(&texObj, GX_NEAR, GX_NEAR, 0.0f, 0.0f, 0.0f, GX_FALSE, GX_FALSE, GX_ANISO_1);
    GXLoadTexObj(&texObj, GX_TEXMAP0);
    MTXOrtho(proj, 0, 480, 0, 640, 0, 10);
    GXSetProjection(proj, GX_ORTHOGRAPHIC);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    color.a = 255;
    GXSetTevColor(GX_TEVREG0, color);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_TEXC, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_KONST);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetNumTexGens(1);
    GXSetNumTevStages(1);
    MTXIdentity(modelview);
    GXLoadPosMtxImm(modelview, GX_PNMTX0);
    GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition3f32(x1, y1, 0);
    GXTexCoord2f32(0, 0);
    GXPosition3f32(x2, y1, 0);
    GXTexCoord2f32(1, 0);
    GXPosition3f32(x2, y2, 0);
    GXTexCoord2f32(1, 1);
    GXPosition3f32(x1, y2, 0);
    GXTexCoord2f32(0, 1);
    GXEnd();
#ifdef TARGET_PC
    GXDestroyTexObj(&texObj);
#endif
}

void fn_1_6594(s16 arg0, Work347CUnk4 *arg1, GXTexWrapMode arg2, s32 arg3, BOOL arg4)
{
    GXTexObj texObj;
    GXInitTexObj(&texObj, arg1->bmpData, arg1->sizeX, arg1->sizeY, GX_TF_RGB565, arg2, arg2, FALSE);
    if (arg4) {
        GXInitTexObjLOD(&texObj, GX_LINEAR, GX_LINEAR, 0.0f, 0.0f, 0.0f, GX_FALSE, GX_FALSE, GX_ANISO_1);
    }
    else {
        GXInitTexObjLOD(&texObj, GX_NEAR, GX_NEAR, 0.0f, 0.0f, 0.0f, GX_FALSE, GX_FALSE, GX_ANISO_1);
    }
    GXLoadTexObj(&texObj, arg0);
#ifdef TARGET_PC
    GXDestroyTexObj(&texObj);
#endif
}

s32 fn_1_6698(Vec *arg0, float arg1, float arg2, s32 arg3)
{
    Work347C *work;
    Work347C *work2;
    Work347CUnk74 *workUnk74;
    s32 i;
    if (!lbl_1_bss_6C) {
        return -1;
    }
    work = lbl_1_bss_6C->data;
    work2 = work;
    workUnk74 = &work->unk74[0];
    for(i = 0; i < 64; i++, workUnk74++) {
        if (workUnk74->unk1E == 0) {
            break;
        }
    }
    if (i >= 64) {
        return -1;
    }
    workUnk74->unk0 = *arg0;
    if (arg1 < 0.0f) {
        workUnk74->unkC.x = 1;
    }
    else {
        workUnk74->unkC.x = arg1;
    }
    if (arg2 < 0.0f) {
        workUnk74->unkC.z = 1;
    }
    else {
        workUnk74->unkC.z = arg2;
    }
    if(arg3 < 0) {
        workUnk74->unk1C = REFRESH_RATE;
    } else {
        workUnk74->unk1C = arg3;
    }
    workUnk74->unkC.y = (s32)frand() % 360;
    workUnk74->unk1E = workUnk74->unk1C;
    workUnk74->unk18 = 1.0f / workUnk74->unk1C;
    return i;
}

float fn_1_687C(void)
{
    if (!lbl_1_bss_6C) {
        return 0;
    }
    else {
        Work347C *work = lbl_1_bss_6C->data;
        return work->unkA44;
    }
}

float fn_1_68C8(void)
{
    if (!lbl_1_bss_6C) {
        return 0;
    }
    else {
        Work347C *work = lbl_1_bss_6C->data;
        return work->unkA40;
    }
}

typedef struct work6914 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    ANIMDATA *unk10;
    Vec unk14;
    Vec unk20;
    Vec unk2C;
} Work6914;

void fn_1_6A6C(omObjData *object);

void fn_1_6914(omObjData *object)
{
    Work6914 *work;
    s32 i;
    ANIMDATA *anim;
    work = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work6914) * 8, MEMORY_DEFAULT_NUM);
    memset(work, 0, sizeof(Work6914) * 8);
    anim = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 26), MEMORY_DEFAULT_NUM));
    for (i = 0; i < 8; i++, work++) {
        work->unk10 = anim;
        work->unk0 = i;
        work->unk4 = Hu3DParticleCreate(work->unk10, 32);
        Hu3DModelCameraSet(work->unk4, HU3D_CAM0);
        Hu3DModelLayerSet(work->unk4, 6);
        Hu3DModelAttrSet(work->unk4, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(work->unk4, HU3D_ATTR_PARTICLE_KILL);
        work->unk8 = 0;
        work->unkC = 0;
        work->unk14.x = work->unk14.y = work->unk14.z = 0;
        work->unk20.x = work->unk20.y = work->unk20.z = 0;
        work->unk2C.x = work->unk2C.y = work->unk2C.z = 1;
    }
    object->func = fn_1_6A6C;
}

void fn_1_6A6C(omObjData *object)
{
    Work6914 *work = object->data;
    s32 i;
    for (i = 0; i < 8; i++, work++) {
        if (work->unk8 == 0) {
            continue;
        }
        if (work->unkC > 1) {
            HU3DMODEL *modelP = &Hu3DData[work->unk4];
            HU3DPARTICLE *particleP = modelP->hookData;
            HU3DPARTICLEDATA *data = particleP->data;
            s32 j;
            for (j = 0; j < particleP->maxCnt; j++, data++) {
                if (++data->time > data->parManId) {
                    s32 alpha = data->color.a - 1;
                    if (alpha < 0) {
                        data->scale = 0;
                    }
                    else {
                        data->color.a = alpha;
                    }
                }
                data->scale *= 0.975;
                data->pos.x += data->vel.x;
                data->pos.y += data->vel.y;
                data->pos.z += data->vel.z;
                data->vel.y -= 0.3103333379576603;
            }
        }
        if(++work->unkC > REFRESH_RATE_F * 1.5f) {
            Hu3DModelAttrSet(work->unk4, HU3D_ATTR_DISPOFF);
            work->unk8 = 0;
        }
        else {
            Hu3DModelPosSet(work->unk4, work->unk14.x, work->unk14.y, work->unk14.z);
            Hu3DModelRotSet(work->unk4, work->unk20.x, work->unk20.y, work->unk20.z);
            Hu3DModelScaleSet(work->unk4, work->unk2C.x, work->unk2C.y, work->unk2C.z);
        }
    }
}

void fn_1_6C60(omObjData *object)
{
    Work6914 *work = object->data;
    ANIMDATA *anim = work->unk10;
    anim->useNum = 0;
    HuSprAnimKill(anim);
}

s32 fn_1_6CB0(Vec *arg0, float arg1)
{
    Work6914 *work = lbl_1_bss_68->data;
    s32 i;
    HU3DMODEL *temp_r27;
    HU3DPARTICLE *temp_r28;
    HU3DPARTICLEDATA *temp_r30;

    for (i = 0; i < 8; i++, work++) {
        if (work->unk8 == 0) {
            break;
        }
    }
    if (i >= 8) {
        return -1;
    }
    Hu3DModelAttrReset(work->unk4, HU3D_ATTR_DISPOFF);
    work->unk8 = 1;
    work->unkC = 0;
    temp_r27 = &Hu3DData[work->unk4];
    temp_r28 = temp_r27->hookData;
    temp_r28->blendMode = 1;
    temp_r30 = temp_r28->data;
    for (i = 0; i < temp_r28->maxCnt; i++, temp_r30++) {
        float temp_f30 = ((s32)frand() % 20) + 90;
        float temp_f29 = (s32)frand() % 360;
        float temp_f26 = sind(temp_f30);
        float temp_f28 = cosd(temp_f30);
        float temp_f25 = 0.75f + 0.15f * (0.007874016f * ((s32)frand() & 0x7F));
        float temp_f31 = 0.15f;
        temp_r30->vel.x = temp_f31 * (0.65f * (50.0 * (temp_f28 * sind(temp_f29))));
        temp_r30->vel.z = temp_f31 * (0.65f * (50.0 * (temp_f28 * cosd(temp_f29))));
        temp_r30->vel.y = temp_f31 * (50 * temp_f26 * temp_f25);
        temp_r30->time = 0;
        temp_r30->parManId = ((s32)frand() % 16) + 45;
        temp_r30->zRot = (s32)frand() % 360;
        temp_r30->scale = 145;
        temp_r30->pos.x = 0.05f * (((s32)frand() & 0x7F) - 64);
        temp_r30->pos.y = 0.65f * (((s32)frand() & 0x7F) - 64);
        temp_r30->pos.z = 0.05f * (((s32)frand() & 0x7F) - 64);
        temp_r30->color.r = ((s32)frand() % 64) + 192;
        temp_r30->color.g = ((s32)frand() % 64) + 192;
        temp_r30->color.b = ((s32)frand() % 64) + 192;
        temp_r30->color.a = 64;
    }
    if (arg1 < 0.0f) {
        arg1 = 1.0f;
    }
    work->unk14 = *arg0;
    work->unk20.x = work->unk20.y = work->unk20.z = 0;
    work->unk2C.x = work->unk2C.y = work->unk2C.z = arg1;
    Hu3DModelPosSet(work->unk4, work->unk14.x, work->unk14.y, work->unk14.z);
    Hu3DModelRotSet(work->unk4, work->unk20.x, work->unk20.y, work->unk20.z);
    Hu3DModelScaleSet(work->unk4, work->unk2C.x, work->unk2C.y, work->unk2C.z);
    return i;
}

