zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
void fn_1_7368(omObjData *object);

void fn_1_7280(omObjData *object)
{
    s32 i;
    for (i = 0; i < object->mdlcnt; i++) {
        if (i == 0) {
            object->model[i] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 9));
        }
        else {
            object->model[i] = Hu3DModelLink(object->model[0]);
        }
        Hu3DModelCameraSet(object->model[i], HU3D_CAM0);
        Hu3DModelLayerSet(object->model[i], 6);
        Hu3DModelAttrSet(object->model[i], HU3D_ATTR_DISPOFF);
    }
    object->stat |= 0x100;
    object->func = fn_1_7368;
}

void fn_1_7368(omObjData *object)
{
    s32 i;
    for (i = 0; i < object->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[object->model[i]];
        if (!(modelP->attr & HU3D_ATTR_DISPOFF)) {
            if (Hu3DMotionTimeGet(object->model[i]) >= Hu3DMotionMaxTimeGet(object->model[i])) {
                Hu3DModelAttrSet(object->model[i], HU3D_ATTR_DISPOFF);
            }
        }
    }
}

void fn_1_7430(omObjData *object) { }

s32 fn_1_7434(Vec *pos, float scale)
{
    s32 i;
    for (i = 0; i < lbl_1_bss_64->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_64->model[i]];
        if (modelP->attr & HU3D_ATTR_DISPOFF) {
            break;
        }
    }
    if (i >= lbl_1_bss_64->mdlcnt) {
        return -1;
    }
    Hu3DMotionTimeSet(lbl_1_bss_64->model[i], 0);
    Hu3DMotionSpeedSet(lbl_1_bss_64->model[i], 1);
    Hu3DModelPosSet(lbl_1_bss_64->model[i], pos->x, pos->y, pos->z);
    Hu3DModelScaleSet(lbl_1_bss_64->model[i], scale, scale, scale);
    Hu3DModelAttrReset(lbl_1_bss_64->model[i], HU3D_ATTR_DISPOFF);
    return i;
}

void fn_1_76B0(omObjData *object);

void fn_1_75C0(omObjData *object)
{
    HU3DPARTICLE *temp_r30;
    HU3DPARTICLEDATA *temp_r29;
    s32 i;
    HU3DMODEL *modelP;
    ANIMDATA *anim = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 26), MEMORY_DEFAULT_NUM));

    object->data = anim;
    object->model[0] = Hu3DParticleCreate(anim, 64);
    Hu3DModelCameraSet(object->model[0], HU3D_CAM0);
    Hu3DModelLayerSet(object->model[0], 3);
    Hu3DModelAttrReset(object->model[0], HU3D_ATTR_PARTICLE_KILL);
    modelP = &Hu3DData[object->model[0]];
    temp_r30 = modelP->hookData;
    temp_r29 = temp_r30->data;
    temp_r30->blendMode = 1;
    for (i = 0; i < temp_r30->maxCnt; i++, temp_r29++) {
        temp_r29->scale = 0;
    }
    object->func = fn_1_76B0;
}

void fn_1_76B0(omObjData *object)
{
    HU3DMODEL *modelP = &Hu3DData[object->model[0]];
    HU3DPARTICLE *temp_r29 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r30 = temp_r29->data;
    s32 i;
    for (i = 0; i < temp_r29->maxCnt; i++, temp_r30++) {
        if (temp_r30->scale <= 0.0f) {
            continue;
        }
        if (++temp_r30->time > 360) {
            temp_r30->time -= 360;
        }
        temp_r30->pos.x += temp_r30->vel.x * sind(2.0f * temp_r30->time);
        temp_r30->pos.y += temp_r30->vel.y;
        if(temp_r30->pos.y >= 0.0f) {
            fn_1_6698(&temp_r30->pos, 0.00625f*temp_r30->scale, 1, REFRESH_RATE / 4);
            temp_r30->scale = 0;
        }
    }
}

void fn_1_7974(omObjData *object)
{
    ANIMDATA *anim = object->data;
    HuSprAnimKill(anim);
    Hu3DModelKill(object->model[0]);
    object->model[0] = -1;
}

s32 fn_1_79C8(Vec *pos, float scale)
{
    s32 i;
    HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_60->model[0]];
    HU3DPARTICLE *temp_r30 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r31 = temp_r30->data;
    for (i = 0; i < temp_r30->maxCnt; i++, temp_r31++) {
        if (temp_r31->scale <= 0.0f) {
            break;
        }
    }
    if (i >= temp_r30->maxCnt) {
        return -1;
    }
    if (scale <= 0.0f) {
        scale = 1.0f;
    }
    temp_r31->pos = *pos;
#if VERSION_PAL
    temp_r31->vel.x = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F)))) * 0.5f;
    temp_r31->vel.z = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))));
    temp_r31->vel.y = 1.2f * (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F)))) * 2.0f;
#else
    temp_r31->vel.x = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))))*0.5f;
    temp_r31->vel.z = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))));
    temp_r31->vel.y = (1.5f+(0.2f*(0.007874016f*((s32)frand() & 0x7F))))*2.0f;
#endif
    temp_r31->time = (s32)frand()%360;
    temp_r31->scale = 20*scale;
    return i;
}

typedef struct work7C48 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    float unkC;
    float unk10;
    Vec unk14;
    Vec unk20;
} Work7C48;

void fn_1_8050(omObjData *object);

void fn_1_7C48(omObjData *object)
{
    Work7C48 *workBase = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work7C48) * 8, MEMORY_DEFAULT_NUM);
    Work7C48 *workP = workBase;
    s32 i;
    memset(workP, 0, 8 * sizeof(Work7C48));
    for (i = 0; i < 8; i++, workP++) {
        switch (i) {
            case 0:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 10));
                break;

            case 1:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 10));
                break;

            default:
                if (i & 0x1) {
                    workP->unk0 = Hu3DModelLink(workBase[0].unk0);
                }
                else {
                    workP->unk0 = Hu3DModelLink(workBase[1].unk0);
                }
                break;
        }
        Hu3DModelScaleSet(workP->unk0, 0.5f, 0.5f, 0.5f);
        Hu3DModelCameraSet(workP->unk0, HU3D_CAM0);
        Hu3DModelLayerSet(workP->unk0, 1);
        workP->unk4 = 0;
        workP->unk8 = 0;
        workP->unkC = 2;
        workP->unk10 = (s32)frand() % 360;
        workP->unk14.x = 1500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk14.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk14.y = -250 + (100 * (0.3f * i));
        workP->unk20.x = 1500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk20.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk20.y = workP->unk14.y;
        Hu3DModelPosSet(workP->unk0, workP->unk14.x, workP->unk14.y, workP->unk14.z);
        Hu3DModelRotSet(workP->unk0, 0, workP->unk10, 0);
    }
    object->func = fn_1_8050;
}

