zeranemesis/Marioparty4/partyboard/src/REL/m455Dll/stage.c
float fn_1_9F18(float start, float end, float weight);

void fn_1_8050(omObjData *object)
{
    Work7C48 *workP = object->data;
    s32 i;
    for (i = 0; i < 8; i++, workP++) {
        float dx;
        float dz;
        float vel;
        float angle;
        if (workP->unk4 == 0) {
            vel = 1 + (0.5 * sind((workP->unk8 * 5) % 180));
        }
        else {
            vel = 3;
        }
#if VERSION_PAL
        workP->unk14.x += vel * (workP->unkC * sind(workP->unk10)) * 1.2f;
        workP->unk14.z += vel * (workP->unkC * cosd(workP->unk10)) * 1.2f;
#else
        workP->unk14.x += vel*(workP->unkC*sind(workP->unk10));
        workP->unk14.z += vel*(workP->unkC*cosd(workP->unk10));
#endif
        dx = workP->unk20.x-workP->unk14.x;
        dz = workP->unk20.z-workP->unk14.z;
        angle = atan2d(dx, dz);
        workP->unk10 = fn_1_9F18(angle, workP->unk10, 3.5f);
        if ((dx * dx) + (dz * dz) < 10000.0f) {
            if (workP->unk4 == 0) {
                workP->unk20.x = 2000 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
                workP->unk20.z = 700 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
                workP->unk20.y = workP->unk14.y;
            }
            else {
                if (workP->unk14.x < 0.0f) {
                    workP->unk20.x = -2500;
                }
                else {
                    workP->unk20.x = 2500;
                }
                workP->unk20.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
                workP->unk20.y = workP->unk14.y;
            }
        }
        Hu3DModelPosSet(workP->unk0, workP->unk14.x, workP->unk14.y, workP->unk14.z);
        Hu3DModelRotSet(workP->unk0, 0, workP->unk10, 0);
        workP->unk8 += frand() & 0x3;
    }
}

void fn_1_8474(omObjData *object) { }

void fn_1_8478(void)
{
    Work7C48 *workP = lbl_1_bss_5C->data;
    s32 i;
    for (i = 0; i < 8; i++, workP++) {
        workP->unk4 = 1;
        if (workP->unk14.x < 0.0f) {
            workP->unk20.x = -2500;
        }
        else {
            workP->unk20.x = 2500;
        }
        workP->unk20.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk20.y = workP->unk14.y;
    }
}

typedef struct work891C {
    s16 unk0;
    s16 unk2[2];
    s16 unk6;
    Vec unk8;
    Vec unk14;
    float unk20;
    float unk24;
    float unk28;
    float unk2C;
    float unk30;
    float unk34;
    float unk38;
    float unk3C;
} Work891C;

void fn_1_8578(omObjData *object, Work891C *workP)
{
    s32 num = workP[0].unk6;
    float ofsZ = -2000;
    s32 i;
    for (i = 0; i < num; i++, workP++) {
        Mtx *modelMtx;
        Mtx rotZ;
        Hu3DModelPosSet(workP->unk0, workP->unk8.x, workP->unk8.y, workP->unk8.z + ofsZ);
        modelMtx = &Hu3DData[workP->unk0].mtx;
        MTXRotDeg(*modelMtx, 'Y', workP->unk28);
        MTXRotDeg(rotZ, 'Z', workP->unk38);
        MTXConcat(*modelMtx, rotZ, *modelMtx);
        Hu3DModelAttrReset(workP->unk0, HU3D_ATTR_DISPOFF);
    }
}

float fn_1_8D90(float start, float end, float weight);

void fn_1_867C(omObjData *object)
{
    Work891C *workP = object->data;
    s32 num = workP[0].unk6;
    s32 i;
    for (i = 0; i < num; i++, workP++) {
        Vec diff;
        s32 unk8 = 0;
        VECSubtract(&workP->unk14, &workP->unk8, &diff);
        workP->unk2C = atan2d(diff.x, diff.z);
        workP->unk28 = fn_1_8D90(workP->unk28, workP->unk2C+workP->unk3C, 0.08f);
        workP->unk24 += 0.05f*(600.0f-workP->unk24);
        workP->unk20 += 0.2f*(workP->unk24-workP->unk20);
        workP->unk8.x += (workP->unk20*REFRESH_FREQ)*sind(workP->unk28);
        workP->unk8.z += (workP->unk20*REFRESH_FREQ)*cosd(workP->unk28);
        workP->unk30 += workP->unk20*REFRESH_FREQ;
    }
    fn_1_8578(object, object->data);
}

void fn_1_891C(omObjData *object)
{
    s16 num = 12;
    Work891C *workBase;
    s32 modelId;
    Work891C *work;
    float radius;
    float angle;
    float ofsZ;
    s32 i;
    object->data = workBase = HuMemDirectMallocNum(HEAP_SYSTEM, num * sizeof(Work891C), MEMORY_DEFAULT_NUM);
    memset(workBase, 0, num * sizeof(Work891C));
    modelId = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M455, 8));
    ofsZ = 1500;
    work = workBase;
    for (i = 0; i < num; i++, work++) {

        work->unk0 = Hu3DModelLink(modelId);
        Hu3DModelLayerSet(work->unk0, 6);
        Hu3DModelCameraSet(work->unk0, 1);
        Hu3DModelScaleSet(work->unk0, 7, 7, 7);
        work->unk14.x = ((s32)frandmod(1000) * 4.0f) - 2000;
        work->unk14.z = ((s32)frandmod(1000)) - 500.0f;
        work->unk14.y = ((s32)frandmod(1000) * 0.8f) + 300;
        angle = (s32)frandmod(360);
        radius = ((s32)frandmod(250)) + 200.0f;
        work->unk8.x = radius * sind(angle);
        work->unk8.y = 0;
        work->unk8.z = radius * cosd(angle);
        VECAdd(&work->unk14, &work->unk8, &work->unk8);
        work->unk38 = 60 - ((6.0f / 55.0f) * radius);
        work->unk28 = (s32)frandmod(360);

        work->unk3C = ((s32)frandmod(1000) < 500) ? (-70.0f + ((s32)frandmod(50) * 0.1f)) : (70.0f - ((s32)frandmod(50) * 0.1f));
        if (work->unk3C < 0.0f) {
            work->unk38 = -work->unk38;
        }
        work->unk30 = 1;
        work->unk34 = 0;
        ofsZ -= 50.0f;
        work->unk6 = num;
    }
    Hu3DModelKill(modelId);
    object->func = fn_1_867C;
}

float fn_1_8D90(float start, float end, float weight)
{
    float angle = fmodf(end - start, 360);
    if (angle < 0.0f) {
        angle += 360.0f;
    }
    if (angle > 180.0f) {
        angle -= 360.0f;
    }
    angle = fmodf(start + (weight * angle), 360);
    if (angle < 0.0f) {
        angle += 360.0f;
    }
    return angle;
}

void fn_1_91B8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

void fn_1_8EAC(void)
{
    StructBss48 *workP = lbl_1_bss_48 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(StructBss48), MEMORY_DEFAULT_NUM);
    HU3DPARTICLE *particle;
    HU3DMODEL *modelP;
    s16 *newWork;
    s32 modelId;
    memset(workP, 0, sizeof(StructBss48));
    workP->unk0[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 13), MEMORY_DEFAULT_NUM));
    workP->unk0[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 14), MEMORY_DEFAULT_NUM));
    workP->unk0[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 15), MEMORY_DEFAULT_NUM));
    workP->unk0[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M455, 16), MEMORY_DEFAULT_NUM));
    workP->unk20.y = 1;
    workP->unk20.z = 0;
    workP->unk10[0] = modelId = Hu3DParticleCreate(workP->unk0[0], 1);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16) * 4, modelP->mallocNo);
    memset(newWork, 0, 4 * sizeof(s16));
    newWork[1] = 0;
    workP->unk10[1] = modelId = Hu3DParticleCreate(workP->unk0[3], 10);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16) * 4, modelP->mallocNo);
    memset(newWork, 0, 4 * sizeof(s16));
    newWork[1] = 1;
    workP->unk10[2] = modelId = Hu3DParticleCreate(workP->unk0[2], 4);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16) * 4, modelP->mallocNo);
    memset(newWork, 0, 4 * sizeof(s16));
    newWork[1] = 2;
    workP->unk10[3] = modelId = Hu3DParticleCreate(workP->unk0[1], 6);
    Hu3DModelLayerSet(modelId, 6);
    modelP = &Hu3DData[modelId];
    particle = modelP->hookData;
    particle->blendMode = 1;
    particle->hook = fn_1_91B8;
    newWork = particle->work = HuMemDirectMallocNum(HEAP_DATA, sizeof(s16) * 4, modelP->mallocNo);
    memset(newWork, 0, 4 * sizeof(s16));
    newWork[1] = 3;
}

void fn_1_9168(void)
{
    StructBss48 *workP = lbl_1_bss_48;
#ifndef NON_MATCHING
    // these already get freed in HuSprAnimKill by hsfman.c
    HuSprAnimKill(workP->unk0[0]);
    HuSprAnimKill(workP->unk0[1]);
    HuSprAnimKill(workP->unk0[2]);
    HuSprAnimKill(workP->unk0[3]);
#endif
}

